Table of Contents
 Enum TypeOfCalculationDeflection
Namespace
IdeaRS.OpenModel.Concrete
Assembly
IdeaRS.OpenModel.dll
Define type of support conditions
public enum TypeOfCalculationDeflection
Fields
BothOfThem = 3
both calculation is done, it is for comparative results
CheckSlenderness = 0
check slenderness calculation, if rules are full filed no other calculation is done
CheckSlendernessContinueDirectCalculation = 1
if check of slenderness is not ok then, directly calculation of deflection is done
DirectCalculation = 2
check of slenderness is not taken into account, directly calculation of deflection is done
Fields
 Name |  Description
 BothOfThem = 3
both calculation is done, it is for comparative results
 CheckSlenderness = 0
check slenderness calculation, if rules are full filed no other calculation is done
 CheckSlendernessContinueDirectCalculation = 1
if check of slenderness is not ok then, directly calculation of deflection is done
 DirectCalculation = 2
check of slenderness is not taken into account, directly calculation of deflection is done
 Edit this page